<?PHP


// http://en.wikipedia.org/wiki/Oriya_script#Bengali_in_Unicode
// http://en.wikibooks.org/wiki/Windows_Programming/Unicode/Character_reference/0000-0FFF


$v = "୍"; // Virama

/* Main arrays */

$num['tra'] = array(
	60 => "0",
	61 => "1",
	62 => "2",
	63 => "3",
	64 => "4",
	65 => "5",
	66 => "6",
	67 => "7",
	68 => "8",
	69 => "9",
);

$main['tra'] = array(

	//20 => "t ", // t end
		
	40 => "'", // apostrophe (avagraha)
	41 => "`", // Latin apostrophe (’)
	42 => "#", // Abbreviation
	
	116 => "kha",
	115 => "ka",
	118 => "gha",
	117 => "ga",
	119 => "Ga",

	121 => "cha",
	120 => "ca",
	123 => "jha",
	122 => "ja",
	124 => "Ja",

	126 => "Tha",
	125 => "Ta",
	128 => "Dha",
	127 => "Da",
	129 => "Na",

	131 => "tha",
	130 => "ta",
	133 => "dha",
	132 => "da",
	134 => "na",

	136 => "pha",
	135 => "pa",
	138 => "bha",
	137 => "ba",
	139 => "ma",
	
	140 => "ya",
	141 => "Ya",
	142 => "ra",
	
	202 => "lla", // lla
	143 => "la",
	144 => "va",
	
	145 => "za",
	146 => "Sa",
	147 => "sa",
	
	149 => "M",
	150 => "H",
	151 => "~",
	152 => "||", // ||
	153 => "|", // |
	154 => "Q", // . Nukta
	155 => "@", // Abbreviation


	
	201 => "Pha",
	200 => "Pa",
	
	148 => "ha",
);

$vow['tra'] = array(

	257 => " R",
	258 => " q",
	259 => " L",
	260 => " W",
	
	261 => " e",
	262 => " ai",
	263 => " o",
	264 => " au",
	
	251 => " a",
	252 => " A",
	253 => " i",
	254 => " I",
	255 => " u",
	256 => " U",
);


$yukta['tra'] = array(

	307 => "R", // joint
	308 => "q", // joint
	309 => "L", // joint
	310 => "W", // joint
	
	311 => "e", // joint
	312 => "ai", // joint
	313 => "o", // joint
	314 => "au", // joint
	
	301 => "a", // joint
	302 => "A", // joint
	303 => "i", // joint
	304 => "I", // joint
	305 => "u", // joint
	306 => "U", // joint
);


$num['scr'] = array(
	60 => "୦", // 0
	61 => "୧", // 1
	62 => "୨", // 2
	63 => "୩", // 3
	64 => "୪", // 4
	65 => "୫", // 5
	66 => "୬", // 6
	67 => "୭", // 7
	68 => "୮", // 8
	69 => "୯", // 9
);

$main['scr'] = array(

	//20 => "ৎ", // t end
	
	40 => "ଽ", // apostrophe (avagraha)
	41 => "’", // Latin apostrophe (’)
	42 => "॰", // Abbreviation

	
	116 => "ଖ", // kha
	115 => "କ", // ka
	118 => "ଘ", // gha
	117 => "ଗ", // ga
	119 => "ଙ", // Ga
	
	121 => "ଛ", // cha
	120 => "ଚ", // ca
	123 => "ଝ", // jha
	122 => "ଜ", // ja
	124 => "ଞ", // Ja
	
	126 => "ଠ", // Tha
	125 => "ଟ", // Ta
	128 => "ଢ", // Dha
	127 => "ଡ", // Da
	129 => "ଣ", // Na
	
	131 => "ଥ", // tha
	130 => "ତ", // ta
	133 => "ଧ", // dha
	132 => "ଦ", // da
	134 => "ନ", // na
	
	136 => "ଫ", // pha
	135 => "ପ", // pa
	138 => "ଭ", // bha
	137 => "ବ", // ba
	139 => "ମ", // ma
	
	140 => "ଯ", // ya
	141 => "ୟ", // Ya
	142 => "ର", // ra
	
	202 => "ଳ", // lla
	143 => "ଲ", // la
	144 => "ବ", // va
	
	145 => "ଶ", // za
	146 => "ଷ", // Sa
	147 => "ସ", // sa
	
	149 => "ଂ", // M
	150 => "ଃ", // H
	151 => "ଁ", // ~
	152 => "॥", // ||
	153 => "।", // |
	154 => "଼", // . Nukta
	155 => "॰", // Abbreviation


	
	201 => "ଢ଼", // Pha
	200 => "ଡ଼", // Pa

	
	148 => "ହ", // ha
);

$vow['scr'] = array(


	
	257 => " ଋ", // R
	258 => " ୠ", // q
	259 => " ଌ", // L
	260 => " ୡ", // W 
	
	261 => " ଏ", // e
	262 => " ଐ", // ai
	263 => " ଓ", // o
	264 => " ଔ", // au
	
	251 => " ଅ", // a
	252 => " ଆ", // A
	253 => " ଇ", // i
	254 => " ଈ", // I
	255 => " ଉ", // u
	256 => " ଊ", // U
	
);

$yukta['scr'] = array(
	
	307 => "ୃ", // R joint
	308 => "ৄ", // q joint // missing!
	309 => "ৢ", // L joint // missing!
	310 => "ৣ", // W  joint w// missing!
	
	311 => "େ", // e joint
	312 => "ୈ", // ai joint
	313 => "ୋ", // o joint
	314 => "ୌ", // au joint
	
	301 => "&#8205;", // a joint
	302 => "ା", // A joint
	303 => "ି", // i joint
	304 => "ୀ", // I joint
	305 => "ୁ", // u joint
	306 => "ୂ", // U joint
);


?>